from fastapi import APIRouter, Request


router = APIRouter()


@router.post("/get")
async def get_locations(request: Request):
    data = await request.json()

    assert "location" in data

    return {
        "Radio": [4.0, 1000.0, 4.7, 4.2],
        "Кухня": [4.0, 350.0, 4.5, 4.0],
        "Just In": [5.0, 500.0, 4.3, 3.8],
        "Kalabaska": [5.0, 700.0, 4.8, 3.9],
        "Лавр": [4.5, 1000.0, 4.3, 4.0],
        "Chicko": [4.0, 750.0, 4.7, 4.3],
        "Tokpokki": [5.5, 800.0, 5.0, 4.2],
        "Вкусно-и Точка": [8.0, 500.0, 4.8, 4.9],
        "Марсель": [7.0, 135.0, 4.6, 4.8],
        "Pho U": [7.5, 300.0, 4.4, 3.5],
        "Spreda": [6.5, 800.0, 4.5, 4.2],
        "Братья Караваевы": [7.5, 700.0, 4.5, 4.8],
        "Тбилиси": [7.0, 330.0, 4.4, 3.2],
        "Папа Джонс": [13.0, 300.0, 4.2, 4.2],
        "ВкусВилл": [10.0, 300.0, 4.5, 4.4],
        "Брюгге": [10.0, 410.0, 5.0, 4.4],
    }
